       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADD-TWO-NUMBERS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC 9 VALUE 2.
       01 B PIC 9 VALUE 2.
       01 RESULT PIC 99.
       PROCEDURE DIVISION.
           ADD A TO B GIVING RESULT.
           DISPLAY "RESULT: " A " + " B " = " RESULT.
           STOP RUN.
