       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRINT_2.
       PROCEDURE DIVISION.
           DISPLAY "The Thing You've Been Doing Is Not Enough"
           STOP RUN.
